#+TITLE: Kapitel 17: Objektorientierung in Java
#+INCLUDE: "../template/header.org"

#+STARTUP: showeverything
# TODO states: looks like this has to go on main file and cannot be
# included 
#+TODO: TODO(t) | UEBUNG(u) DONE(d)
#+OPTIONS: tasks:todo

#+LATEX_HEADER: \setcounter{chapter}{17}

** Zugriff auf Daten 

Auf Daten eines Objekts kann wie gewohnt durch Punkt-Notation
zugegriffen werden

#+BEGIN_SRC java :exports both :results output :classname Ellipse
  class Ellipse {
      // Daten deklarieren: 
      double x, y;
      double achse1, achse2;
  }

  Ellipse e; 
  e = new Ellipse();
  e.x = 17.12;
  System.out.println(2 * e.x);
#+END_SRC 

#+RESULTS:
: e ==> null
: e ==> Ellipse@13805618
: $4 ==> 17.12
: 34.24


** Zuweisung zwischen Objektvariablen 

Variablen vom Typ einer Klasse sind Referenzvariablen! 
- Analog zu ~Array~, ~String~ 
- Also Zuweisung: Kopie der Referenz! 

#+BEGIN_SRC java :exports both :results output :classname Ellipse
  class Ellipse {
      // Daten deklarieren: 
      double x, y;
      double achse1, achse2;
  }

  Ellipse e1, e2; 
  e1 = new Ellipse();
  e2 = e1;
  e1.x = 17.12;
  System.out.println(e2.x);  
#+END_SRC 

#+RESULTS:
: e1 ==> null
: e2 ==> null
: e1 ==> Ellipse@56ef9176
: e2 ==> Ellipse@56ef9176
: $6 ==> 17.12
: 17.12

** Klassendeklaration: Beispiel Ellipse mit Methode 


#+BEGIN_SRC java :exports both :results output :classname Ellipse
  class Ellipse {
      // Daten deklarieren: 
      double x, y;
      double achse1, achse2;

      void verschiebe(double deltax, double deltay) {
          this.x += deltax;
          this.y += deltay;
      }
  }

  // verkürzte Notation: 
  Ellipse e = new Ellipse();
  e.x = 17.12;
  e.verschiebe(5, -0.2);
  System.out.println(e.x);
#+END_SRC 

#+RESULTS:
: e ==> Ellipse@cb644e
: $3 ==> 17.12
: 22.12

** Überladene Methoden: Beispiele 

- ~System.out.print~! 

#+BEGIN_SRC java :exports both :results output :classname ZuweisungA
  class UeberladeneMethoden {
      void f(int a) { System.out.println("Variante 1"); }
      void f(char a) { System.out.println("Variante 2"); }
      void f(String a) { System.out.println("Variante 3"); }
      void f(double a) { System.out.println("Variante 4"); } 
  }

  UeberladeneMethoden u = new UeberladeneMethoden();

  u.f('a');
  u.f(17);
  u.f(4096);
  u.f("Hallo");
  u.f(42.17);
#+END_SRC 

#+RESULTS:
: u ==> UeberladeneMethoden@cb644e
: Variante 2
: Variante 1
: Variante 1
: Variante 3
: Variante 4

** Globale Variablen: Beispiel 


#+BEGIN_SRC java :exports both :results output :classname  GlobalVariablesClass
  class Ellipse {
      // Daten deklarieren: 
      double x, y;
      double achse1, achse2;
      static int magic = 3;
    
      double flaeche() {
          return magic * this.achse1 * this.achse2;
      }
  }

  Ellipse e = new Ellipse();; 
  e.achse1 = 2.3;
  e.achse2 = 4.5;
  System.out.println(e.flaeche());
#+END_SRC 

#+RESULTS:
: e ==> Ellipse@59494225
: $4 ==> 2.3
: $5 ==> 4.5
: 31.049999999999997


** Wrappers, Boxing 


- Alle Klassen sind von ~Object~ abgeleitet
  - Damit alle Objekte mit ~Object~ zuweisungskompatibel 
- Einfache Typen sind aber keine Klassen
  - ~int~, ~char~, ...
- /Wrapper/-Klasse: eine normalen Wert in ein passendes Objekt
  einwickeln
  - ~Integer~ für ~int~, ~Boolean~ für ~boolean~, etc. 
- Umständlich, deswegen weitgehend automatisch durch Compiler: Boxing
  und Unboxing 

#+BEGIN_SRC java :exports both :results output :classname XXX
Integer intObj = new Integer(42);
int x = intObj.intValue();
#+END_SRC 

#+RESULTS:
: intObj ==> 42
: x ==> 42


** Kompatibilität bei Zuweisung 


- Einer Variable vom Typ Oberklasse darf ein Objekt einer Unterklasse
  zugewiesen werden 
- Umgekehrt: Nein! 
- Beispiel: 

#+BEGIN_SRC java :exports both :results output :classname XXX
  class Article {
      String artikelnummer;
  }

  class Book extends Article {
      String ISBN;
  }

  // das ist erlaubt: 
  Book b1 = new Book();
  Article a1 = b1;

  // das scheitert, ein Artikel ist kein Buch:
  Article a2 = new Article();
  Book b2 = a2;
#+END_SRC 

#+RESULTS:
: b1 ==> Book@56ef9176
: a1 ==> Book@56ef9176
: a2 ==> Article@ff5b51f


** Zugriff auf Felder nach Zuweisung zu Variable eines Oberklassentyps 

- Kann man nach Zuweisung zu einer Oberklassentypisierten Variable
  noch auf die Daten (oder Methoden) der Unterklasse zugreifen?
  - Die sind in dem Objekt ja noch vorhanden
  - Es wurde ja nur der Typ der /Referenz/ geändert; am Objekt selbst
    ist nichts passiert! 

#+BEGIN_SRC java :exports both :results output :classname XXX
  class Article {
      String artikelnummer;
  }

  class Book extends Article {
      String ISBN;
  }

  // das ist erlaubt: 
  Book b1 = new Book();
  b1.ISBN = "abc"; 
  System.out.println(b1.ISBN); 

  // Zuweisung an Oberklasse
  Article a1 = b1;
  // funktioniert das? 
  System.out.println(a1.ISBN); 
#+END_SRC 

#+RESULTS:
: b1 ==> Book@56ef9176
: $4 ==> "abc"
: abc
: a1 ==> Book@56ef9176

** Unterklasse zurückbekommen? Typecasts zwischen Objekten? 

- Aber man könnte das doch typecasten? 
- Wir zwingen den Compiler, eine Interpretation der Referenz als
  ~Book~ zu akzeptieren!
- (Vergleich Python: Keine Notwendigkeit für Typecasts zwischen
  Klassen) 

#+BEGIN_SRC java :exports both :results output :classname XXX
  class Article {
      String artikelnummer;
  }

  class Book extends Article {
      String ISBN;
  }

  // das ist erlaubt: 
  Book b1 = new Book();
  b1.ISBN = "abc"; 

  Article a1 = b1;
  Book b2 = (Book) a1;
  System.out.println(b2.ISBN);
#+END_SRC 

#+RESULTS:
: b1 ==> Book@56ef9176
: $4 ==> "abc"
: a1 ==> Book@56ef9176
: b2 ==> Book@56ef9176
: abc

** Typecast wenn falsches Objekt? 

- Was passiert, wenn wir einen typecast (irrtümlich?) auf ein falsches
  Objekt anwenden?
- Beispiel: 


#+BEGIN_SRC java :exports both :results output :classname XXX
  class Article {
      String artikelnummer;
  }

  class Book extends Article {
      String ISBN;
  }

  Article a1 = new Article();

  // das scheitert; a1 ist kein Book 
  Book b2 = (Book) a1;
  System.out.println(b2.ISBN);
#+END_SRC 

#+RESULTS:
: a1 ==> Article@56ef9176


** Vor einem Typecast nachschauen? Reflektion? 

- Kann man bei einem Objekt nachschauen, ob es zu einer bestimmten
  Klasse gehört? 
- Schlüsselwort: ~instanceof~
  - Pendant zu ~isinstance~-Funktion in Python 

#+BEGIN_SRC java :exports both :results output :classname XXX
  class Article {
      String artikelnummer;
  }

  class Book extends Article {
      String ISBN;
  }

  // das scheitert; b2 ist kein Book
  Article a1 = new Article();
  if (a1 instanceof Book) {
      Book b2 = (Book) a1;
      System.out.println(b2.ISBN);
  } else {
      System.out.println("Leider kein Buch!");
  }
#+END_SRC 

#+RESULTS:
: a1 ==> Article@56ef9176
: Leider kein Buch!

** Dynamische Methodenbindung: Beispiel

#+BEGIN_SRC java :exports both :results output :classname XXX
  class Article {
      void m() { System.out.println("m von Artikel"); }
  }

  class Book extends Article {
      void m() { System.out.println("m von Buch"); }
  }

  Article a = new Article();
  Book b = new Book();
  // das hier ist ja klar:
  a.m();
  b.m();

  // was passiert hier?
  Article a1 = b;
  a1.m();

  Book b1 = (Book) a1;
  b1.m();
#+END_SRC 

#+RESULTS:
: a ==> Article@56ef9176
: b ==> Book@1ed4004b
: m von Artikel
: m von Buch
: a1 ==> Book@1ed4004b
: m von Buch
: b1 ==> Book@1ed4004b
: m von Buch


** Sichtbarkeit zwischen Klassen: Zugriff von außen  

Zugriff von außen/aus anderen Klassen: 

#+BEGIN_SRC java :exports both :results output :classname XXX
class A {
    private int u;
    protected int v;
    public int w;
    int x;
    
    void m() {
        this.u = 5;
        this.v = 5;
        this.w = 5;
        this.x = 5;
    }
}

// Zugriff von aussen: 
A a = new A();
a.u = 42;
a.v = 42;
a.w = 42;
a.x = 42;

// Zugriff auf Attribute aus eigener Methode: 
a.m();
#+END_SRC 

#+RESULTS:
: a ==> A@cb644e
: $3 ==> 42
: $4 ==> 42
: $5 ==> 42

** Unterklassen von abstrakten Klassen: Fehlende Methoden ergänzen 

- Abstrakte Klasse in Unterklasse ableiten 
- Dort die fehlende Methode(n) implementieren
- Wenn alle abstrakten Methoden konkret geworden sind, kann man auch
  Objekte instantiieren 
- Beispiel: 

#+BEGIN_SRC java :exports both :results output :classname XXX
  abstract class Tier {
                boolean frisst (String food) { return false; }
      abstract  void    sprich (); 
  }

  class Hund extends Tier {
      // Hunde sind Allesfresser: 
      boolean frisst (String food) { return true; }
      void    sprich () { System.out.println("woof!"); } 
  }

  Hund h = new Hund();
  h.sprich();
#+END_SRC 

#+RESULTS:
: h ==> Hund@56ef9176
: woof!

** Variablen abstrakter Klassen speichern Referenz auf konkrete Unterklasse 

- Abstrakte Klasse instantiieren nicht möglich
- Aber sehr wohl möglich: Referenz auf konkretes Objekt speichern
- Und dort konkrete Methoden aufrufen
- Wenig überraschend ... 

#+BEGIN_SRC java :exports both :results output :classname XXX
  abstract class Tier {
                boolean frisst (String food) { return false; }
      abstract  void    sprich (); 
  }

  class Hund extends Tier {
      // Hunde sind Allesfresser: 
      boolean frisst (String food) { return true; }
      void    sprich () { System.out.println("woof!"); } 
  }

  Hund h = new Hund();
  Tier t = h;
  t.sprich();
#+END_SRC 

#+RESULTS:
: h ==> Hund@56ef9176
: t ==> Hund@56ef9176
: woof!



** Variablen abstrakter Klassen speichern Referenz auf konkrete Unterklasse  (3) 
#+BEGIN_SRC java :exports both :results output :classname XXX
  abstract class Tier {
                boolean frisst (String food) { return false; }
      abstract  void    sprich (); 
  }

  class Hund extends Tier {
      // Hunde sind Allesfresser: 
      boolean frisst (String food) { return true; }
      void    sprich () { System.out.println("woof!"); } 
  }

  class Maus extends Tier {
      // Mäuse fressen nur Käse: 
      boolean frisst (String food) { return (food == "Käse"); }
      void    sprich () { System.out.println("meep"); } 
  }

  class Tierfarm {
      Tier [] meineTiere;
      Tierfarm() { this.meineTiere = new Tier[0]; }
      Tierfarm(Tier[] anfangstiere) { this.meineTiere = anfangstiere; }
  
      void konzert() { this.konzert(this.meineTiere); }   
      void konzert(Tier [] andereTiere) { for (Tier t: andereTiere) t.sprich(); }   
  }

  Tierfarm farm = new Tierfarm(new Tier[] { new Hund(), new Maus()});
  farm.konzert();
  Tierfarm farm2 = new Tierfarm();
  farm2.konzert( new Tier[] { new Maus(), new Hund ()});
#+END_SRC 

#+RESULTS:
: ch(); }
: farm ==> Tierfarm@4566e5bd
: woof!
: meep
: farm2 ==> Tierfarm@25bbe1b6
: meep
: woof!

** ~interface~ und ~extend~: Beispiel 


#+BEGIN_SRC java :exports both :results output :classname XXX
  interface foo {
      void foo();
  }

  interface bar {
      void bar();
  }

  class A {
      public void foo() { System.out.println("foo"); }
  }

  class B extends A implements foo, bar {
      public void bar() { System.out.println("BAR"); }
  }

  B b = new B();
  b.foo();
  b.bar();
#+END_SRC 

#+RESULTS:
: b ==> B@25bbe1b6
: foo
: BAR

